3_chapter/taskleaf/app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])

    if (@user.update(user_params))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "画面テスト(権限なし)"], ["password_digest", "$2a$12$b/zfgTOXu7S9zUrrU7Nk5ePj8kIQnHoW5edWjHRer5UQk3hT9jltO"], ["updated_at", "2023-09-16 06:59:40.663136"], ["id", 4]]