3_chapter/taskleaf/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def current_user
    # || = とスペースを空けてはいけない
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]