3_chapter/taskleaf/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ニュータスク（フィルタ後）"], ["description", "だぞん"], ["created_at", "2023-09-16 07:38:08.369214"], ["updated_at", "2023-09-16 07:38:08.369214"], ["user_id", 6]]
---
  def create
    @task = Task.new(task_params.merge(user_id: current_user.id))
    if @task.save

UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "だよ〜ん\r\n"], ["updated_at", "2023-09-16 07:37:32.851668"], ["id", 18]]
---
  def update
    logger.debug "パラメータ: #{task_params} ぱらむ: #{params}"
    @task.update!(task_params)